---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarHandleType.RebarPlane
enum: Autodesk.Revit.DB.Structure.RebarHandleType
source: html/0773859c-5f30-3fb4-25b3-34c80432aaa4.htm
---
# Autodesk.Revit.DB.Structure.RebarHandleType.RebarPlane

Handle controlling the location of the Rebar's primary plane.
 Drives location of the entire Rebar along the direction of its normal.